class GameData:
    """Класс для хранения данных игры"""
    
    # Данные для генерации карточек игроков
    GENDERS = ["Мужчина", "Женщина"]
    
    BODY_TYPES = ["Худощавое", "Толстое", "Среднее", "Спортивное"]
    
    SKILL_LEVELS = [
        ("Начинающий", 0.4),      # 40% шанс
        ("Средний", 0.3),         # 30% шанс
        ("Профессионал", 0.2),    # 20% шанс
        ("Эксперт", 0.1)    # 10% шанс
    ]
    
    TRAITS = [
        "Трудолюбивый", "Ленивый", "Общительный", "Замкнутый", "Умный", "Глупый", 
        "Творческий", "Практичный", "Храбрый", "Трусливый", "Честный", "Лживый",
        "Оптимист", "Пессимист", "Щедрый", "Жадный", "Терпеливый", "Вспыльчивый",
        "Добрый", "Злой", "Внимательный", "Рассеянный", "Аккуратный", "Неряшливый",
        "Целеустремленный", "Безвольный", "Спокойный", "Нервный", "Веселый", "Угрюмый",
        "Любопытный", "Равнодушный", "Ответственный", "Безответственный", "Дружелюбный", "Агрессивный"
    ]
    
    PROFESSIONS = [
        "Врач", "Инженер", "Учитель", "Военный", "Фермер", "Программист", 
        "Повар", "Строитель", "Ученый", "Пилот", "Электрик", "Сантехник",
        "Психолог", "Биолог", "Химик", "Механик", "Сварщик", "Охотник"
    ]
    
    HEALTH_STATES = [
        ("Здоров", 0.3),  # 30% шанс
        ("Диабет", 0.05),  
        ("Астма", 0.05),         
        ("Аллергия", 0.05),      
        ("Болезнь сердца", 0.05),
        ("Проблемы со зрением", 0.05),
        ("Неизвестная болезнь", 0.05),
        ("Анемия", 0.05),
        ("Артрит", 0.05),
        ("Мигрень", 0.05),
        ("Депрессия", 0.05),
        ("Гипертония", 0.05),
        ("Язва желудка", 0.05),
        ("Бессонница", 0.05),
        ("Эпилепсия", 0.05)
    ]

    HEALTH_STAGES = [
        ("Лёгкое", 0.5),
        ("Среднее", 0.3),
        ("Тяжёлое", 0.2)
    ]
    
    HOBBIES = [
        "Рыбалка", "Садоводство", "Чтение", "Рисование", "Музыка", 
        "Спорт", "Готовка", "Фотография", "Шахматы", "Коллекционирование",
        "Туризм", "Охота", "Программирование", "Ремонт техники", "Вязание"
    ]
    
    PHOBIAS = [
        "Клаустрофобия", "Акрофобия (страх высоты)", "Арахнофобия (страх пауков)", 
        "Никтофобия (страх темноты)", "Аквафобия (страх воды)", "Агорафобия (страх открытых пространств)",
        "Айлурофобия (страх кошек)", "Гемофобия (страх крови)", "Кинофобия (страх собак)", 
        "Астрафобия (страх грозы)", "Социофобия (страх общения)", "Мизофобия (страх микробов)",
        "Танатофобия (страх смерти)", "Аэрофобия (страх полетов)", "Герпетофобия (страх рептилий)",
        "Апифобия (страх пчел)", "Трипанофобия (страх уколов)", "Ксенофобия (страх незнакомцев)",
        "Офидиофобия (страх змей)", "Монофобия (страх одиночества)"
    ]
    
    INVENTORY = [
        "Аптечка", "Набор инструментов", "AK-47", "Винтовка",
        "Спальный мешок", "Палатка", 
        "Солнечная батарея", "Фильтр для воды", "Газовая горелка", "Бинокль",
        "Дизельный генератор", "Запас топлива", "Сварочный аппарат", "Токарный станок",
        "Мотоцикл", "Квадрокоптер", "Радиостанция", "Корова", "Свинья", "Курица", "Кошка", "Собака",
        "Промышленный холодильник", "Система гидропоники", "Инкубатор для яиц",
        "Промышленная стиральная машина", "Дистиллятор воды", "Ветрогенератор",
        "Промышленная печь", "Медицинское оборудование", "Телескоп",
        "Сейф", "Верстак с инструментами", "Швейная машинка", "3D-принтер",
        "Лодка", "Снегоход", "Переносная теплица", "Мини-трактор",
        "Токарный станок", "Фрезерный станок", "Сушильный шкаф"
    ]
    
    BACKPACK_ITEMS_COUNT_MAX = 5
    BACKPACK_ITEMS = [
        ("Нож", 1, 3), "Спички (упаковка)", ("Фляга с водой", 1, 3), ("Консервы", 1, 10), ("Батарейки", 1, 6),
        ("Свечи", 1, 8), ("Блокнот и ручка", 1, 3), ("Антисептик", 1, 4), "Зажигалка", "Рыболовные снасти",
        "Сухой паек", "Радиоприемник", "Часы", ("Кофе", 1, 5), ("Чай", 1, 5), ("Шоколад", 1, 6), ("Веревка", 1, 3),
        "Фонарик", "Компас", "Карта", "Аптечка первой помощи", "Мультитул",
        "Спальный мешок", "Термос", "Солнцезащитные очки", ("Репеллент от насекомых", 1, 4),
        "Зубная щетка и паста", ("Мыло", 1, 3), ("Полотенце", 1, 3), ("Теплая одежда", 1, 3), ("Дождевик", 1, 3),
        "Перчатки", "Бинокль", ("Сигнальная ракета", 1, 5), ("Таблетки для очистки воды (упаковка)", 1, 2),
        "Швейный набор", ("Скотч", 1, 3), ("Зарядное устройство", 1, 3), ("Портативный аккумулятор", 1, 3),
        "Спутниковый телефон", "Солнечная зарядка", ("Рация", 1, 3), "Топор", "Лопата",
        "Котелок", "Фильтр для воды", ("Спички в водонепроницаемой упаковке", 1, 4),
        ("Сухое горючее", 1, 5), ("Марля", 1, 6), ("Бинты", 1, 8), ("Антибиотики", 1, 4), ("Обезболивающее", 1, 5),
        ("Противоаллергенные препараты", 1, 3), ("Активированный уголь", 1, 5), ("Витамины", 1, 4),
        "Тепловое одеяло", "Противогаз", "Свисток", "Гироскопический компас",  
        "Солнечный дистиллятор", ("Пластыри с антисептиком", 1, 10), "Складная пила",  
        "Трут для розжига", "Солнечные очки ночного видения", ("Герметичные пакеты", 1, 8),  
        "Гипсовая повязка", ("Гемостатические салфетки", 1, 6), "Складной нож-пила",  
        "Термобельё", "Противопожарное полотно", "Солнечная печь",  
        "Аварийный маяк", ("Гидроизоляционный спрей", 1, 3), "Складной стакан",  
        "Навигационная книга (атлас за 5 класс)", ("Самозатягивающиеся стяжки", 1, 10), ("Пластиковые хомуты", 1, 15),  
        "Фольгированная пеленка", "Солнечный отражатель", ("Экстренный запас денег", 1, 5),  
        "Мини-газовая горелка", "Складной дуршлаг",  
        ("Алюминиевые крючки", 1, 12), "Фляга с фильтром", "Солнечный опреснитель",  
        ("Запасные носки", 1, 5), ("Термостельки", 1, 4), "Противомоскитная сетка",  
        "Складной стул", "Портативный душ", "Гидратор с трубкой",  
        "Аварийный паек на 72 часа", "Солнечный трекер", "Антистатический коврик",
        ("Коробка c патронами", 1, 4), "Карта местности", ("Шампуры", 1, 20),
        "Микроскоп"
    ]
    
    ADDITIONAL_INFO = [
        # Навыки выживания
        "Умеет разводить огонь без спичек", "Знает съедобные растения", "Умеет ставить ловушки",
        "Имеет опыт выживания в дикой природе", "Умеет очищать воду", "Знает основы первой помощи",
        
        # Практические навыки
        "Умеет шить одежду", "Хорошо готовит", "Умеет консервировать продукты",
        "Разбирается в электрике", "Умеет ремонтировать технику", "Знает основы строительства",
        "Умеет варить мыло", "Умеет делать свечи", "Умеет выращивать растения",
        
        # Интеллектуальные навыки
        "Знает несколько иностранных языков", "Разбирается в медицине", "Имеет фотографическую память",
        "Эксперт по криптографии", "Знает высшую математику", "Разбирается в химии",
        
        # Социальные навыки
        "Хороший лидер", "Умеет разрешать конфликты", "Отличный рассказчик",
        "Умеет поднять боевой дух", "Хорошо работает в команде", "Умеет вести переговоры",
        
        # Творческие навыки
        "Умеет играть на нескольких музыкальных инструментах", "Талантливый художник",
        "Пишет стихи и песни", "Умеет танцевать", "Хороший актер", "Умеет делать скульптуры",
        
        # Необычные навыки
        "Умеет читать по губам", "Владеет языком жестов", "Разбирается в астрономии",
        "Умеет предсказывать погоду", "Хорошо ориентируется по звездам", "Умеет гипнотизировать",
        
        # Полезные знания
        "Знает все о грибах и ягодах", "Разбирается в лекарственных травах",
        "Умеет делать самогон", "Знает как делать порох", "Умеет обращаться с любым оружием",
        "Эксперт по системам безопасности"
    ]
    
    SPECIAL_ABILITIES_CHANCE = 0.35
    SPECIAL_ABILITIES = [
        "Может улучшить здоровье у выбранного игрока на 1 ступень",
        "Может ухудшить здоровье у выбранного игрока на 1 ступень",
        "Может поменять пол у выбранного игрока на противоположный",
        "Может получить новый случайный предмет в свой инвентарь",
        "Может получить новый случайный предмет в свой рюкзак",
        "Может расширить бункер на 30 кв.м",
        "Может открыть одну характеристику другого игрока",
        "Может заставить показать всех игроков одну характеристику",
        "Может украсть одну вещь из рюкзака другого игрока",
        "Может украсть одну вещь из инвентаря другого игрока",
        "Может поменяться одной характеристикой с другим игроком", # Выбор игрока и характеристики
    ]
    
    # Данные для генерации бункера

    BUNKER_THEMES = [
        "Зомби апокалипсис",
        "Ядерная война", 
        "Вирус",
        "Наводнение",
        "Захват пришельцами",
        "Стихийные бедствия",
        "Космические катаклизмы", 
        "Экологическая катастрофа",
        "Техногенная катастрофа",
        "Эпидемия",
        "Смертоносное оружие, созданное людьми вышло из под контроля",
        "Животные сошли с ума",
        "Восстание искусственного интеллекта",
        "Глобальное похолодание",
        "Химическая война",
        "Извержение супервулкана",
        "Падение астероида",
        "Биологическое оружие",
        "Массовые беспорядки и анархия",
        "Магнитная буря уничтожила всю электронику",
        "Вторжение из параллельного измерения",
        "Мутация растений превратила их в хищников",
        "Пробуждение древних монстров",
        "Исчезновение кислорода из атмосферы"
    ]
    BUNKER_SIZES = ["Маленький (30 кв.м)", "Средний (60 кв.м)", "Большой (100 кв.м)", "Огромный (150 кв.м)"]
    BUNKER_DURATIONS = ["6 месяцев", "1 год", "2 года", "3 года", "5 лет", "10 лет"]
    FOOD_SUPPLIES = [
        "Еды нет", "Очень мало еды (на месяц)", "Мало еды (на полгода)", 
        "Достаточно еды (на 2 года)", "Много еды (на 4 года)"
    ]
    BUNKER_ITEMS_COUNT_MAX = 3
    BUNKER_ITEMS = [
        # Полезные предметы
        "Медицинское оборудование", "Система фильтрации воды", "Система очистки воздуха",
        "Генератор электричества", "Оружейная комната", "Библиотека", "Лаборатория",
        "Теплица для выращивания растений", "Радиооборудование", "Компьютерное оборудование",
        "Запас медикаментов", "Мастерская", "Инструменты для ремонта", "Запчасти для техники",
        
        # Развлечения и досуг
        "Коллекция настольных игр", "Музыкальные инструменты", "Спортивный инвентарь",
        "Художественные принадлежности", "Домашний кинотеатр", "Караоке-система",
        
        # Сомнительная польза
        "Коллекция редких марок", "Чучело медведя", "Статуя Давида в полный рост",
        "Аквариум с экзотическими рыбками", "Коллекция бабочек", "Старый пинбольный автомат",
        
        # Потенциально опасные
        "Экспериментальные химикаты", "Нестабильный реактор", "Контейнер с неизвестным вирусом",
        "Взрывоопасные материалы", "Радиоактивные элементы", "Ядовитые растения в горшках",
        
        # Странные и бесполезные
        "Чемодан с париками", "Коллекция резиновых уточек", "Сломанный факс",
        "Стопка журналов 1980-х годов", "Чучело единорога", "Машина для производства мыльных пузырей"
    ]